JaroLisiak/Monopost-telemetry/Atollic/TrueSTUDIO/STM32_workspace_9.0/Telemetry_v2_formula/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 ** This notice applies to any and all portions of this file
 * that are not between comment pairs USER CODE BEGIN and
 * USER CODE END. Other portions of this file, whether
 * inserted by the user or by software development tools
 * are owned by their respective copyright owners.
 *
 * COPYRIGHT(c) 2019 STMicroelectronics
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"

/* USER CODE BEGIN Includes */
#include "gps.h"
#include "CAN2018.h"
#include <string.h>

#define GPSSENTENCE 100
#define ESP32SENTENCE 2
#define HC12SENTENCE 2


/*
 // LORA return codes
 #define LORA_OK                            0
 #define LORA_CRC_ERROR                     1
 #define LORA_TIMEOUT                       2
 #define LORA_INVALID_HEADER                3
 #define LORA_ERROR                         4
 #define LORA_BUSY                          5
 #define LORA_EMPTY                         6
 */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
CAN_HandleTypeDef hcan1;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

SPI_HandleTypeDef hspi2;
SPI_HandleTypeDef hspi3;
SPI_HandleTypeDef hspi4;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart7;
UART_HandleTypeDef huart8;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

uint16_t unAvailableTime = 3000;

// Timers flags
uint8_t Tim1Flag = 0;
uint8_t Tim2Flag = 0;
uint8_t Tim3Flag = 0;
uint8_t Tim4Flag = 0;

// Availible states
uint8_t hcAvailible = 1;


// HC-12
uint8_t hcRxChar[2];	// character from HC-12
uint8_t hcSentence[HC12SENTENCE];
uint16_t hcSentenceLength = 0;
uint8_t hcSentenceReady = 0;
uint32_t hcLastOK = 0;

// GPS
uint8_t RxFromGpsBuffer[2];
uint8_t Gps_Sentence[GPSSENTENCE];
int Gps_Sentence_length = 0;

// ESP32 - WiFi
uint8_t esp32RxChar[2];
uint8_t Esp32_Sentence[ESP32SENTENCE];
int Esp32_Sentence_length = 0;
uint8_t esp32Availible = 0;
uint32_t esp32LastOK = 0;


// ID of package
uint16_t msgID = 1;	// packet ID
char* sendWiFiMsg(uint8_t *msg, uint16_t *msg_len);
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_CAN1_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C2_Init(void);
static void MX_SPI2_Init(void);
static void MX_SPI3_Init(void);
static void MX_SPI4_Init(void);
static void MX_UART7_Init(void);
static void MX_UART8_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM4_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/


uint16_t getCharCount(uint8_t *msg, uint8_t *msg_len, uint8_t ch) {
	int count = 0;
	for (int i = 0; i < *msg_len; i++) {
		if (*(msg + i) == ch) {
			count++;
		}
	}
	return count;
}

uint8_t sendHc12(uint8_t *msg, uint8_t *msg_len) {
	// send via HC-12 (434 MHz)

	hcAvailible = 0;
	uint16_t specCharCount = getCharCount(msg, msg_len, 0xff)
			+ getCharCount(msg, msg_len, 0xfe);
	uint8_t * new_msg = (uint8_t*) malloc(*msg_len + specCharCount + 6);// original size + doubled chars + header & footer
	new_msg[0] = 0x00;
	new_msg[1] = 0xfe;
	new_msg[2] = 0x00;

	uint16_t oldIndex = 0;
	uint16_t newIndex = 3;
	for (oldIndex = 0; oldIndex < *msg_len; oldIndex++) {
		if ((*(msg + oldIndex) == 0xff) || (*(msg + oldIndex) == 0xfe)) {
			new_msg[newIndex++] = *(msg + oldIndex);
			new_msg[newIndex++] = *(msg + oldIndex);
		} else {
			new_msg[newIndex++] = *(msg + oldIndex);
		}
	}
	new_msg[newIndex++] = 0x00;
	new_msg[newIndex++] = 0xff;
	new_msg[newIndex++] = 0x00;

	uint8_t res = HAL_UART_Transmit(&huart8, new_msg, newIndex, 300);
	HAL_Delay(100);	
	vypis("\r\n");
	free(new_msg);
	hcAvailible = 1;
	return res;
}
uint8_t sendEsp32(uint8_t *msg, uint8_t *msg_len) {
	HAL_GPIO_TogglePin(LED3_GPIO_Port, LED3_Pin);
	// send via HC-12 (434 MHz)

	uint16_t specCharCount = getCharCount(msg, msg_len, 0xff)
			+ getCharCount(msg, msg_len, 0xfe);
	uint8_t * new_msg = (uint8_t*) malloc(*msg_len + specCharCount + 6);// original size + doubled chars + header & footer
	new_msg[0] = 0x00;
	new_msg[1] = 0xfe;
	new_msg[2] = 0x00;

	uint16_t oldIndex = 0;
	uint16_t newIndex = 3;
	for (oldIndex = 0; oldIndex < *msg_len; oldIndex++) {
		if ((*(msg + oldIndex) == 0xff) || (*(msg + oldIndex) == 0xfe)) {
			new_msg[newIndex++] = *(msg + oldIndex);
			new_msg[newIndex++] = *(msg + oldIndex);
		} else {
			new_msg[newIndex++] = *(msg + oldIndex);
		}
	}
	new_msg[newIndex++] = 0x00;
	new_msg[newIndex++] = 0xff;
	new_msg[newIndex++] = 0x00;

