JaroLisiak/Monopost-telemetry/Atollic/TrueSTUDIO/STM32_workspace_9.0/Telemetry_v2_formula/Src/main.c
	sendWiFiMsg(new_msg, newIndex);
	HAL_Delay(100);	
	free(new_msg);
}

void send(uint8_t *msg, uint8_t *msg_len) {
	uint8_t res = sendWiFiMsg(msg, msg_len);
	uint8_t res2 = sendHc12(msg, msg_len);
}

uint8_t * append_message_ID(uint8_t *msg, uint16_t *msg_len, uint16_t ID) {
	uint8_t dataSize = 2; // ID is uint16 (2 bytes)
	msg = (uint8_t *) realloc(msg, *msg_len + dataSize * sizeof(uint8_t));

	int index = *msg_len;
	msg[0] = ID & 0xff;
	msg[1] = ID >> 8;
	*msg_len = *msg_len + dataSize;
	return msg;
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
	if (huart == &huart8) {
		// HC-12

		if ((hcRxChar[0] == 'O')) {
			hcSentence[0] = 'O';
		} else if ((hcRxChar[0] == 'K') && (hcSentence[0] == 'O')) {
			hcLastOK = HAL_GetTick();
			hcSentence[0] = 0x00;
			hcSentence[1] = 0x00;
		} else {
			hcSentence[0] = 0x00;
			hcSentence[1] = 0x00;
		}
		HAL_GPIO_TogglePin(LED1_GPIO_Port, LED1_Pin);
		HAL_UART_Receive_IT(&huart8, hcRxChar, 1);
	}
	if (huart == &huart7) {
		// wifi module

		if ((esp32RxChar[0] == 'O')) {
			Esp32_Sentence[0] = 'O';
		} else if ((esp32RxChar[0] == 'K') && (Esp32_Sentence[0] == 'O')) {
			
			esp32LastOK = HAL_GetTick();
			
			Esp32_Sentence[0] = 0x00;
			Esp32_Sentence[1] = 0x00;
		} else {
			Esp32_Sentence[0] = 0x00;
			Esp32_Sentence[1] = 0x00;
		}

		HAL_GPIO_TogglePin(LED1_GPIO_Port, LED1_Pin);
		
		HAL_UART_Receive_IT(&huart7, esp32RxChar, 1);

	}
	if (huart == &huart1) {
		// GPS
		if (RxFromGpsBuffer[0] == '$') {
			Gps_Sentence_length = 0;
			Gps_Sentence[Gps_Sentence_length++] = RxFromGpsBuffer[0];
		} else {
			if (RxFromGpsBuffer[0] == '\n') {
				Gps_Sentence[Gps_Sentence_length++] = RxFromGpsBuffer[0];
				GPS_FindSentence(&GPS_msg, Gps_Sentence, 0, 100);
				if (GPS_msg.type != NMEA_BAD) {
					GPS_sentences_parsed++;
					GPS_ParseSentence(Gps_Sentence, &GPS_msg);
				} else
					GPS_sentences_unknown++;
			} else {
				Gps_Sentence[Gps_Sentence_length++] = RxFromGpsBuffer[0];
			}
		}
		HAL_UART_Receive_IT(&huart1, RxFromGpsBuffer, 1);
	}
}

void vypis(char str[]) {
	// uncomment to debug
	// comment to real conditions

	//HAL_UART_Transmit(&huart2, (uint8_t*) str, strlen(str), 20);

	//HAL_GPIO_TogglePin(LED2_GPIO_Port, LED2_Pin);
}

char * addToMsg(char dst[], const char src[]) {
	int sizeNewArray = strlen(dst) + strlen(src) + 1;
	char * newJSON = (char *) malloc(sizeNewArray);
	strcpy(newJSON, dst);
	strcpy(newJSON + strlen(dst), src);
	free(dst);	// free old memory
	return newJSON;
}

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 *
 * @retval None
 */
int main(void) {
	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration----------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_CAN1_Init();
	MX_I2C1_Init();
	MX_I2C2_Init();
	MX_SPI2_Init();
	MX_SPI3_Init();
	MX_SPI4_Init();
	MX_UART7_Init();
	MX_UART8_Init();
	MX_USART1_UART_Init();
	MX_USART2_UART_Init();
	MX_USART3_UART_Init();
	MX_TIM1_Init();
	MX_TIM2_Init();
	MX_TIM3_Init();
	MX_TIM4_Init();
	/* USER CODE BEGIN 2 */

	HAL_TIM_Base_Start_IT(&htim1);
	HAL_TIM_Base_Start_IT(&htim2);
	HAL_TIM_Base_Start_IT(&htim3);
	HAL_TIM_Base_Start_IT(&htim4);

	GPS_InitData();

	if (HAL_UART_Receive_IT(&huart8, hcRxChar, 1) != HAL_OK) {
		// HC-12 error
		hcAvailible = 0;
		vypis("\n\nHC-12 ERROR!!  \r\n\n");
	}

	if (HAL_UART_Receive_IT(&huart1, RxFromGpsBuffer, 1) != HAL_OK) {
		// GPS error
	}

	if (HAL_UART_Receive_IT(&huart7, esp32RxChar, 1) != HAL_OK) {
		// ESP32 error
		vypis("\n\nESP32 ERROR!!  \r\n\n");
	}
	if (HAL_CAN_Start(&hcan1) != HAL_OK) {
		// can error
	}

	/*
	 * 				  RX - TX
	 * USART 1 - GPS - PA10, PA9
	 * GPS: 9600 Baud, 8 bits, no parity bit, 1 stop bit,
	 *
	 * USART 2 - SERIAL USB - PA3, PA2
	 * USART 3 - MICROBUS CLICK2 - PD9, PD8 + PD11 + PD12
	 * UART 7 - ESP32 - PE7, PE8
	 * UART 8 - HC-12 - PE0, PE1, PC3 (set)
	 * SET PIN = low (reset) -> setting mode, AT
	 * SET PIN = high (set) -> communication mode
	 *
	 * SPI2 - LORA - PB12, PB13, PB14, PB15
	 * USART3
	 *
	 * I2C2 - GPS
	 *
	 */

	/*
	 * HC-12 config
	 */
	HAL_GPIO_WritePin(HC_SET_GPIO_Port, HC_SET_Pin, GPIO_PIN_RESET); // config mode
	HAL_Delay(100);


	// +20 dBm boost transmit
	HAL_UART_Transmit(&huart8, "AT+P8\0", 6, 100);
	HAL_Delay(100);

	// set HC-12 to normal (sending) mode
	HAL_GPIO_WritePin(HC_SET_GPIO_Port, HC_SET_Pin, GPIO_PIN_SET); // send mode
	HAL_Delay(100);

	/* USER CODE END 2 */

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */

	while (1) {

		uint8_t* msg = malloc(sizeof(uint8_t));
		uint16_t msg_len = 0;
		msg = append_message_ID(msg, &msg_len, msgID++); // append packet ID to message


		if (Tim1Flag) {
			// send CAN ID 10, 15, 20

			msg = append_BBOX_power_Data(msg, &msg_len);
			msg = append_wheel_RPM_Data(msg, &msg_len);
			msg = append_BBOX_status_Data(msg, &msg_len);

			Tim1Flag = 0;
		}
		if (Tim2Flag) {
			//send CAN iD 25,30,40,50

			msg = append_FU_Values_1(msg, &msg_len);
			msg = append_BBOX_command(msg, &msg_len);
			msg = append_BMS_Command(msg, &msg_len);
			msg = append_BMS_State(msg, &msg_len);

			Tim2Flag = 0;
		}
		if (Tim3Flag) {
			// send CAN ID 60, 70, 80, 90, 95 + GPS data

			msg = append_ECU_State(msg, &msg_len);
			msg = append_FU_Values_2(msg, &msg_len);

			msg = append_GPS_Data(msg, &msg_len);

			Tim3Flag = 0;
		}
		if (Tim4Flag) {
			// For CAN ID 184 - 290
			msg = append_Interconnect(msg, &msg_len);
			msg = append_BMS_Voltages(msg, &msg_len);
			msg = append_BMS_Temps(msg, &msg_len);

		}

		send(msg, &msg_len); // sendData(msg, &msg_len);
		free(msg);

		HAL_Delay(500);

		HAL_GPIO_TogglePin(LED4_GPIO_Port, LED4_Pin);

		/* USER CODE END WHILE */

