JaroLisiak/Monopost-telemetry/Atollic/TrueSTUDIO/STM32_workspace_9.0/Telemetry_v2_formula/Src/main.c
	/*Configure GPIO pins : HC_SET_Pin LED1_Pin */
	GPIO_InitStruct.Pin = HC_SET_Pin | LED1_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

	/*Configure GPIO pins : M_STAT_Pin M_RI_Pin */
	GPIO_InitStruct.Pin = M_STAT_Pin | M_RI_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	/*Configure GPIO pin : M_PWR_Pin */
	GPIO_InitStruct.Pin = M_PWR_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(M_PWR_GPIO_Port, &GPIO_InitStruct);

	/*Configure GPIO pins : LED4_Pin LED3_Pin LED2_Pin CAN_STB_Pin */
	GPIO_InitStruct.Pin = LED4_Pin | LED3_Pin | LED2_Pin | CAN_STB_Pin;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim) {
	/*
	 * Intervals:
	 * 1: 100ms - 287 - 62499
	 * 2: 500ms - 719 - 62499
	 * 3: 1s - 1439 - 62499
	 * 4: 2s - 5624 - 63999
	 */
	if (htim->Instance == htim1.Instance) {
		//  100 ms
		Tim1Flag = 1;
	}
	if (htim->Instance == htim2.Instance) {
		//  500 ms
		Tim2Flag = 1;
	}
	if (htim->Instance == htim3.Instance) {
		//  1000 ms
		Tim3Flag = 1;
	}
	if (htim->Instance == htim4.Instance) {
		//  2000 ms
		Tim4Flag = 1;
	}
}


uint8_t * removeDoubles(uint8_t *msg, uint16_t *msg_len) {
	uint16_t specCharCount = getCharCount(msg, msg_len, 0xfe)
			+ getCharCount(msg, msg_len, 0xff);
	uint16_t new_msg_size = (*msg_len) - 6 - ((specCharCount - 2) / 2);	// old size - 2 border chars - doubled
	uint8_t * new_msg = (uint8_t *) malloc(new_msg_size);
	uint16_t newIndex = 0;
	uint16_t oldIndex = 0;
	if ((*(msg) == 0x00) && (*(msg + 1) == 0xfe) && (*(msg + 2) == 0x00)) {
		oldIndex = 3;
		while (oldIndex < (*msg_len) - 3) {
			if ((*(msg + oldIndex) == 0xff)
					&& (*(msg + oldIndex + 1) == 0xff)) {
				new_msg[newIndex++] = *(msg + oldIndex);
				oldIndex += 2;
			} else if ((*(msg + oldIndex) == 0xfe)
					&& (*(msg + oldIndex + 1) == 0xfe)) {
				new_msg[newIndex++] = *(msg + oldIndex);
				oldIndex += 2;
			} else {
				new_msg[newIndex++] = *(msg + oldIndex);
				oldIndex++;
			}
		}
	}

	*msg_len = new_msg_size;
	// TODO: free?
	free(msg);
	return new_msg;
}

char* sendWiFiMsg(uint8_t *msg, uint16_t *msg_len) {

	uint16_t index = 2;	// first 2 bytes are packet ID
	uint16_t ramecID = ((uint16_t) *(msg + 1) << 8) | *(msg);	// packet ID

	char buff[260];	// buffer for internal JSON - { } - appended tu main JSON - [ { \"%d\":[ -
	char* JSON = malloc(sizeof(char));		// main (final JSON)
	JSON[0] = 0;
	uint16_t JSON_len = 0;

	// start main JSON with [ { \"%d\":[
	char buffer[13];
	sprintf(buffer, "{\"Id\":%d,\"Data\":{", ramecID); // new [{\"Id\":%d,\"Data\":[ 		old: [{\"%d\":[
	JSON = addToMsg(JSON, buffer);
	uint8_t parse_error = 0;
	while (index < *msg_len && parse_error == 0) {
		uint16_t key = ((uint16_t) *(msg + index + 1) << 8) | *(msg + index);
		index++;
		switch (key) {
		case 5:
			// GPS data
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"GPS_data\":{\"latitude\":%u,\"latitude_char\":\"%c\",\"longitude\":%u,\"longitude_char\":\"%c\",\"speed\":%u,\"course\":%u,\"altitude\":%ld}",
					(uint32_t) (*(msg + index + 1) << 24)
							| (uint32_t) (*(msg + index + 2) << 16)
							| (uint32_t) (*(msg + index + 3) << 8)
							| (uint32_t) (*(msg + index + 4)),
					*(msg + index + 5),
					(uint32_t) (*(msg + index + 6) << 24)
							| (uint32_t) (*(msg + index + 7) << 16)
							| (uint32_t) (*(msg + index + 8) << 8)
							| (uint32_t) (*(msg + index + 9)),
					*(msg + index + 10),
					(uint32_t) (*(msg + index + 11) << 24)
							| (uint32_t) (*(msg + index + 12) << 16)
							| (uint32_t) (*(msg + index + 13) << 8)
							| (uint32_t) (*(msg + index + 15)),
					(uint32_t) (*(msg + index + 15) << 24)
							| (uint32_t) (*(msg + index + 16) << 16)
							| (uint32_t) (*(msg + index + 17) << 8)
							| (uint32_t) (*(msg + index + 18)),
					(int32_t) (*(msg + index + 19) << 24)
							| (int32_t) (*(msg + index + 20) << 16)
							| (int32_t) (*(msg + index + 21) << 8)
							| (int32_t) (*(msg + index + 22)));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 23;
			break;
		case 10:
			// BBOX_power_data
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"BBOX_power\":{\"power\":%d,\"current\":%d,\"voltage\":%d}",
					((int16_t) *(msg + index + 2) << 8) | *(msg + index + 1),
					((int16_t) *(msg + index + 4) << 8) | *(msg + index + 3),
					((uint16_t) *(msg + index + 6) << 8) | *(msg + index + 5));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 7;
			break;
		case 15:
			// wheel RPM
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"wheel_RPM\":{\"front_right\":%d,\"front_left\":%d,\"rear_right\":%d,\"rear_left\":%d}",
					((uint16_t) *(msg + index + 2) << 8) | *(msg + index + 1),
					((uint16_t) *(msg + index + 4) << 8) | *(msg + index + 3),
					((uint16_t) *(msg + index + 6) << 8) | *(msg + index + 5),
					((uint16_t) *(msg + index + 8) << 8) | *(msg + index + 7));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 9;
			break;
		case 20:
			// BBOX status data
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"BBOX_status\":{\"SHD_IN\":%d,\"SHD_OUT\":%d,\"TSMS\":%d,\"AIR_N\":%d,\"AIR_P\":%d,\"PRECH_60V\":%d,\"IMD_OK\":%d,\"BMS_OK\":%d,\"SIGNAL_ERROR\":%d,\"SHD_RESET\":%d,\"SHD_EN\":%d,\"POLARITY\":%d,\"FANS\":%d,\"STM_temp\":%d}",
					(uint8_t) (*(msg + index + 2) & 0b10000000) >> 7,
					(uint8_t) (*(msg + index + 2) & 0b01000000) >> 6,
					(uint8_t) (*(msg + index + 2) & 0b00001000) >> 3,
					(uint8_t) (*(msg + index + 1) & 0b10000000) >> 7,
					(uint8_t) (*(msg + index + 1) & 0b01000000) >> 6,
					(uint8_t) (*(msg + index + 1) & 0b00000010) >> 1,
					(uint8_t) (*(msg + index + 1) & 0b00001000) >> 3,
					(uint8_t) (*(msg + index + 1) & 0b00100000) >> 5,
					(uint8_t) (*(msg + index + 2) & 0b00010000) >> 4,
					(uint8_t) (*(msg + index + 2) & 0b00100000) >> 5,
					(uint8_t) (*(msg + index + 1) & 0b00000001) >> 0,
					(uint8_t) (*(msg + index + 1) & 0b00000100) >> 2,
					(uint8_t) (*(msg + index + 1) & 0b00010000) >> 4,
					(int8_t) *(msg + index + 3));
			JSON = addToMsg(JSON, buff);
			JSON_len++;

