JaroLisiak/Monopost-telemetry/Atollic/TrueSTUDIO/STM32_workspace_9.0/Telemetry_v2_formula/Src/main.c
			index = index + 4;
			break;
		case 25:
			// FU_Values_1
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"FU_Values_1\":{\"apps1\":%d,\"apps2\":%d,\"brake1\":%d,\"brake2\":%d,\"error\":%d}",
					(uint8_t) *(msg + index + 1), (uint8_t) *(msg + index + 2),
					(uint8_t) *(msg + index + 3), (uint8_t) *(msg + index + 4),
					((uint16_t) *(msg + index + 6) << 8) | *(msg + index + 5)

					);
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 7;
			break;
		case 30:
			// BBOX_command
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff, "\"BBOX_command\":{\"FANS\":%d,\"SHD_EN\":%d}",
					(uint8_t) (*(msg + index + 1) & 0b10000000) >> 7,
					(uint8_t) (*(msg + index + 1) & 0b01000000) >> 6);
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 2;
			break;
		case 40:
			// BMS_Command
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"BMS_Command\":{\"BMS_Balanc\":%d,\"BMS_FullMode\":%d,\"BMS_OK\":%d,\"BMS_ONOFF\":%d,\"BMS_CAN\":%d}",
					(uint8_t) (*(msg + index + 1) & 0b11000000) >> 6,
					(uint8_t) (*(msg + index + 2) & 0b10000000) >> 7,
					(uint8_t) (*(msg + index + 1) & 0b00110000) >> 4,
					(uint8_t) (*(msg + index + 1) & 0b00001100) >> 2,
					(uint8_t) (*(msg + index + 1) & 0b00000011));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 3;
			break;
		case 50:
			// BMS_State
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"BMS_State\":{\"BMS_Mode\":%d,\"BMS_Faults\":%d,\"CellVolt_L\":%d,\"CellVolt_H\":%d,\"CellTemp_L\":%d,\"CellTemp_H\":%d,\"BMS_Ident\":%d}",
					(uint8_t) *(msg + index + 1),
					((uint16_t) *(msg + index + 3) << 8) | *(msg + index + 2),
					(uint8_t) *(msg + index + 4), (uint8_t) *(msg + index + 5),
					(uint8_t) *(msg + index + 6), (uint8_t) *(msg + index + 7),
					(uint8_t) *(msg + index + 8));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 9;
			break;
		case 60:
			// ECU_State
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"ECU_State\":{\"ECU_Status\":%d,\"FL_AMK_Status\":%d,\"FR_AMK_Status\":%d,\"RL_AMK_Status\":%d,\"RR_AMK_Status\":%d,\"TempMotor_H\":%d,\"TempInverter_H\":%d,\"TempIGBT_H\":%d}",
					(uint8_t) *(msg + index + 1), (uint8_t) *(msg + index + 2),
					(uint8_t) *(msg + index + 3), (uint8_t) *(msg + index + 4),
					(uint8_t) *(msg + index + 5), (uint8_t) *(msg + index + 6),
					(uint8_t) *(msg + index + 7), (uint8_t) *(msg + index + 8));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 9;
			break;
		case 70:
			// FU_Values_2
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"FU_Values_2\":{\"steer\":%d,\"susp_FL\":%d,\"susp_FR\":%d,\"brake_pos\":%d,\"RTD\":%d,\"BOTS\":%d,\"SHDB\":%d,\"INERTIA_SW\":%d,\"reserve\":%d}",
					(int8_t) *(msg + index + 1),
					((uint16_t) *(msg + index + 3) << 8) | *(msg + index + 2),
					((uint16_t) *(msg + index + 5) << 8) | *(msg + index + 4),
					(uint8_t) *(msg + index + 6),
					(uint8_t) (*(msg + index + 7) & 0b10000000) >> 7,
					(uint8_t) (*(msg + index + 7) & 0b01000000) >> 6,
					(uint8_t) (*(msg + index + 7) & 0b00100000) >> 5,
					(uint8_t) (*(msg + index + 7) & 0b00010000) >> 4,
					(uint8_t) *(msg + index + 8));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 9;
			break;
		case 80:
			// Interconnect
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"Interconnect\":{\"car_state\":%d,\"left_w_pump\":%d,\"right_w_pump\":%d,\"brake_red\":%d,\"brake_white\":%d,\"tsas\":%d,\"killswitch_R\":%d,\"killswitch_L\":%d,\"reserve\":%d,\"susp_RR\":%d,\"susp_RL\":%d}",
					(uint8_t) *(msg + index + 1),
					(uint8_t) (*(msg + index + 2) & 0b10000000) >> 7,
					(uint8_t) (*(msg + index + 2) & 0b01000000) >> 6,
					(uint8_t) (*(msg + index + 2) & 0b00100000) >> 5,
					(uint8_t) (*(msg + index + 2) & 0b00010000) >> 4,
					(uint8_t) (*(msg + index + 2) & 0b00001000) >> 3,
					(uint8_t) (*(msg + index + 2) & 0b00000100) >> 2,
					(uint8_t) (*(msg + index + 2) & 0b00000010) >> 1,
					(uint8_t) *(msg + index + 3),
					((uint16_t) *(msg + index + 5) << 8) | *(msg + index + 4),
					((uint16_t) *(msg + index + 7) << 8) | *(msg + index + 6));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 8;
			break;
		case 90:
			// BMS_Voltages
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"BMS_Voltages\":{\"BMS_VoltIdent\":%d,\"BMS_Volt1\":%d,\"BMS_Volt2\":%d,\"BMS_Volt3\":%d,\"BMS_Volt4\":%d,\"BMS_Volt5\":%d,\"BMS_Volt6\":%d,\"BMS_Volt7\":%d}",
					(uint8_t) *(msg + index + 1), (uint8_t) *(msg + index + 2),
					(uint8_t) *(msg + index + 3), (uint8_t) *(msg + index + 4),
					(uint8_t) *(msg + index + 5), (uint8_t) *(msg + index + 6),
					(uint8_t) *(msg + index + 7), (uint8_t) *(msg + index + 8));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 9;
			break;
		case 95:
			// BMS_Voltages
			if (JSON_len > 0) {
				JSON = addToMsg(JSON, ",\0");
			}
			sprintf(buff,
					"\"BMS_Temps\":{\"BMS_TempIdent\":%d,\"BMS_Temp1\":%d,\"BMS_Temp2\":%d,\"BMS_Temp3\":%d,\"BMS_Temp4\":%d,\"BMS_Temp5\":%d,\"BMS_Temp6\":%d,\"BMS_Temp7\":%d}",
					(uint8_t) *(msg + index + 1), (uint8_t) *(msg + index + 2),
					(uint8_t) *(msg + index + 3), (uint8_t) *(msg + index + 4),
					(uint8_t) *(msg + index + 5), (uint8_t) *(msg + index + 6),
					(uint8_t) *(msg + index + 7), (uint8_t) *(msg + index + 8));
			JSON = addToMsg(JSON, buff);
			JSON_len++;
			index = index + 9;
			break;
		default:
			parse_error = 1;
			break;
		}
	}
	JSON = addToMsg(JSON, "}}");	// append last chars to final JSON

	uint8_t res = HAL_UART_Transmit(&huart7, JSON, strlen(JSON), 1500);
	HAL_Delay(50);
	free(JSON);
}

/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @param  file: The file name as string.
 * @param  line: The line in file as a number.
 * @retval None
 */
void _Error_Handler(char *file, int line) {
	/* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	while (1) {
	}
	/* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t* file, uint32_t line)
{
	/* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
	 tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
	/* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
